
### **README.md**  

# üñß Configuraci√≥n de Red en Cisco Packet Tracer üöÄ  

Este proyecto muestra la configuraci√≥n de un **sistema de red en Cisco Packet Tracer**, incluyendo la asignaci√≥n de direcciones IP, activaci√≥n de interfaces y configuraci√≥n de rutas.  

## üìå 1. Descripci√≥n del Sistema  

La red configurada en **Cisco Packet Tracer** incluye:  

- **1 Router Cisco** (modelo 2911 o 1841).  
- **1 Switch** para la conexi√≥n de dispositivos.  
- **2 PCs o m√°s** para pruebas de conectividad.  
- **Asignaci√≥n de direcciones IP en subredes espec√≠ficas**.  

 **Topolog√≠a de la Red** (basada en la imagen proporcionada):  
- El **router** tiene la IP `200.30.40.1` en la interfaz `FastEthernet0/0`.  
- El **switch** distribuye la conexi√≥n a m√∫ltiples dispositivos en la red local.  
- Cada **PC** tiene una IP dentro de la subred `200.30.40.0/24`.  
- Se configura una **ruta est√°tica** para la comunicaci√≥n con redes externas.  

---

## ‚ö° 2. Acceder al Modo de Configuraci√≥n  

Para ingresar al router y comenzar la configuraci√≥n, usamos:  

```bash
Router> enable
Router# configure terminal
```

Esto nos lleva al modo de configuraci√≥n global.

---

## üîß 3. Configurar la Interfaz del Router  

Asignamos una direcci√≥n IP a la interfaz principal del router y la activamos:  

```bash
Router(config)# interface FastEthernet0/0
Router(config-if)# ip address 200.30.40.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

‚úÖ **Explicaci√≥n:**  
- `interface FastEthernet0/0` ‚Üí Accedemos a la interfaz.  
- `ip address 200.30.40.1 255.255.255.0` ‚Üí Asignamos una IP y la m√°scara de subred.  
- `no shutdown` ‚Üí Activamos la interfaz.  

Si la configuraci√≥n es correcta, aparecer√° este mensaje:  
```
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
```

---

## üåç 4. Configuraci√≥n de Rutas Est√°ticas (Opcional)  

Si hay m√°s de una red conectada, configuramos una ruta est√°tica para la salida a internet o a otra red:  


Router(config)# ip route 0.0.0.0 0.0.0.0 200.30.40.2
```
Esto indica que **todo el tr√°fico desconocido** ser√° enviado a `200.30.40.2` (otro router o gateway).

---

## üñ• 5. Configuraci√≥n de los PCs  

Cada PC necesita una direcci√≥n IP dentro de la misma subred. En cada PC, configuramos:  

- **IP:** `200.30.40.10` (o cualquier IP dentro de `200.30.40.0/24`).  
- **M√°scara:** `255.255.255.0`  
- **Gateway:** `200.30.40.1` (IP del router).  

Esto se puede hacer en la configuraci√≥n de la **tarjeta de red (NIC)** de cada PC en **Packet Tracer**.

---

## üõ† 6. Prueba de Conectividad  

Podemos verificar la conectividad entre dispositivos usando **ping**:  

```bash
PC> ping 200.30.40.1
```
Si todo est√° bien, veremos respuestas exitosas:  
```
Reply from 200.30.40.1: bytes=32 time<1ms TTL=64
```

Tambi√©n podemos revisar las configuraciones del router con:  

```bash
Router# show ip interface brief
```

---

## üíæ 7. Guardar la Configuraci√≥n  

Para evitar perder los cambios, guardamos la configuraci√≥n con:  

```bash
Router# write memory
```
o  
```bash
Router# copy running-config startup-config
```

---

## üéØ 8. Conclusi√≥n  

Con esta configuraci√≥n, hemos logrado:  

‚úÖ Establecer la conexi√≥n del **router con la red local**.  
‚úÖ Asignar direcciones **IP est√°ticas** a las interfaces.  
‚úÖ Configurar una **ruta est√°tica** para la comunicaci√≥n con otras redes.  
‚úÖ Permitir la conectividad entre **PCs y el router**.  

Este es un ejemplo b√°sico, pero se puede expandir con **DHCP, NAT, VLANs y m√°s**. üöÄ  


